{
    "intents": [
        {
            "tag": "saludo",
            "patterns": ["hola", "buenos dias", "buenas tardes"],
            "responses": ["Hola, ¿cómo puedo ayudarte hoy?", "¡Buenas! ¿Qué necesitas?"]
        },
        {
            "tag": "despedida",
            "patterns": ["adiós", "hasta luego", "nos vemos"],
            "responses": ["Adiós, ¡que tengas un buen día!", "Hasta luego, ¡vuelve pronto!"]
        },
        {
            "tag": "agradecimiento",
            "patterns": ["Gracias", "Muchas gracias", "Gracias por la información", "Gracias por la ayuda"],
            "responses": ["De nada ¡Estoy para ayudar!", "No hay de qué ¡A tu servicio!"]
        },
        {
            "tag": "Sedes",
            "patterns": ["¿En que sedes se realiza el programa?", "¿En que lugar son las clases?", "¿En donde es?", "¿En donde se dan las clases?"],
            "responses": ["El programa se va a llevar a cabo en las sedes de capital y rivadavia."]
        },
        {
            "tag": "horarios",
            "patterns": ["¿En que dias y horarios?", "¿A que hora son las clases?", "¿Cuales son los horarios y dias disponibles?", "¿Que dias y horarios tienen las clases?"],
            "responses": ["Las clases se van a desarrollar los martes y jueves de 18:30 a 19:30 en sede capital y de 17 a 18 en sede rivadavia."]
        },
        {
            "tag": "precios",
            "patterns": ["¿Cuanto cuesta?", "¿Cual es el costo?", "¿Cuanto sale ingresar al programa?", "¿Cuanto sale?"],
            "responses": ["El costo no tiene ningún valor inicial. Aquel que se inscriba, deberé comprometerse a prestar un servicio relacionado a su área de trabajo para una actividad caritativa o social para ayudar a otras personas"]
        },
        {
            "tag": "objetivo",
            "patterns": ["¿Cual es el fin de este programa?", "¿Cual es el objetivo?", "¿A que aspira este programa?"],
            "responses": ["¡Nuestro principal objetivo es construir una comunidad donde nos ayudemos entre todos! Nosotros damos el puntapié inicial al asistirlos con su salud. Luego, les tocará a ustedes, alumnos, ayudar a otros en el área en que mejor se desempeñen."]
        },
        {
            "tag": "programa",
            "patterns": ["¿En que consiste el programa?", "programa"],
            "responses": ["El programa consiste en brindar un servicio de salud a otras personas a cambio de su servicio en otras actividades sociales. Creemos que entre todos podemos formar una comunidad donde nos ayudamos mutuamente sin necesidad de que medie el factor económico. Constará de dos clases semanales en el que se harán entrenamientos específicos para las patologías asociadas a la obesidad, como el síndrome metabólico"]
        },
        {
            "tag": "entrenamiento",
            "patterns": ["¿Que tipo de entrenamiento se realiza?", "¿Que se da en las clases?", "¿Cómo es el entrenamiento?"],
            "responses": ["El entrenamiento se va a diseñar teniendo como eje principal el entrenamiento de fuerza, para buscar generar mayor masa múscular (hipertrofia). Luego se va a completar con bloques de HIIt y tábata para la metabolización de grasas"]
        },
        {
            "tag": "HIIT",
            "patterns": ["¿Que es HIIT?", "¿En que se basa el hiit?"],
            "responses": ["HIIT es un método de entrenamiento intervalado de alta intensidad (High Intensity Interval Training), en el que se realizan ejercicios con alta demanda energética intercalado con pausas cortas durante un período de tiempo determinado. Este ejercicio apunta a un alto consumo de glucosa durante el ejercicio pero un alto consumo de ácidos grasos libres post-entrenamiento. ¡Ese periodo post ejercicio va a ser nuestra clave para lograr nuestro objetivo!"]
        },
        {
            "tag": "tabata",
            "patterns": ["¿Que es tabata?", "¿En que se basa el tabata?"],
            "responses": ["Es una variante del método HIIT en el que el tiempo de ejercicio/pausa del circuito es de 20x10 respectivamente. Los tiempos por lo general mantienen una relación de 2 a 1 (Si el ejercicio es de 20 segundos, la mitad de ese número será el tiempo de pausa de descanso antes del siguiente ejercicio)."]
        },
        {
            "tag": "resultados",
            "patterns": ["¿Cuanto tiempo hace falta entrenar para ver resultados?", "¿Cuando tengo resultados?"],
            "responses": ["A partir de los 3 meses de entrenamiento van a notar los primeros resultados. El fin de este programa es generar el hábito de la actividad física, por lo que se espera que mantenga la rutina con los años. La idea no es solucionar un problema puntualmente, sino generar un hábito que te garantice la salud en tu día a día."]
        }
    ]
}
